Repository: gokugoku-kun/AsProgrammer_InputCSV
Catalog: software/lang/*.po
Languages: es, tr

source: Установлен размер страницы кратный двум!
es: ¡El tamaño de la página se estableció en un múltiplo de dos!
tr: Sayfa boyutu ikinin katı olarak ayarlanmıştır!

source: Установлен стандартный размер страницы
es: Tamaño de página predeterminado establecido
tr: Varsayılan sayfa boyutu ayarı

source: Возможно включена защита на запись. Нажмите кнопку "Снять защиту" и сверьтесь с даташитом
es: Es posible que tengas habilitada la protección contra escritura. Haz clic en el botón "Desproteger" y verifica la hoja de datos
tr: Yazma koruması etkin olabilir."Korumayı kaldır" düğmesini tıklayın ve veri sayfasını kontrol edin

source: Изменен
es: Cambiado
tr: Değiştirildi

source: Проверьте настройки
es: Comprobar ajustes
tr: Ayarları kontrol et

source: Чип будет стерт и перезаписан. Продолжить?
es: El chip se borrará y se sobrescribirá. ¿Continuar?
tr: IC silinecek ve programlanacaktır.Devam edilsin mi?

source: Ошибка подключения к
es: Error conectando a
tr: Bağlantı hatası

source: Готово
es: Terminado
tr: Tamamlandı

source: Стираю флэшку...
es: Borrando memoria...
tr: IC siliniyor...

source: Перейти по адресу
es: Ir a la dirección
tr: Adrese Git

source: Микросхема не отвечает
es: El microchip no responde
tr: IC desteklenmiyor

source: (Неизвестно)
es: (Desconocido)
tr: (Bilinmeyen)

source: Данная версия прошивки не поддерживает I2C и MW!
es: ¡Esta versión de firmware no es compatible con I2C y MW!
tr: Firmware yazılımı I2C ve MW'yi desteklemiyor!

source: Стало Sreg:
es: Sreg convertido:
tr: Yeni SREG:

source: Используется программатор:
es: Programador utilizado:
tr: Kullanılan programlayıcı:

source: Значение не найдено
es: Valor no encontrado
tr: Değer bulunamadı

source: Данная версия прошивки не поддерживается!
es: ¡Esta versión de firmware no es compatible!
tr: Firmware yazılımı bellek programlamayı desteklemiyor!

source: Было Sreg:
es: SREG antiguo:
tr: Eski SREG:

source: Читаю флэшку...
es: Leyendo flash...
tr: Hafıza Okunuyor...

source: Поиск HEX значения
es: Buscar valor HEX
tr: HEX değeri ara

source: Ошибка установки скорости SPI
es: Error de configuración de velocidad SPI
tr: SPI hız ayarı hatası

source: Размер:
es: Tamaño:
tr: Boyut:

source: Укажите шестнадцатеричные числа
es: Especificar números hexadecimales
tr: HEX numarası kullan

source: Точно стереть чип?
es: ¿Borrar el chip?
tr: IC silinsin mi ?

source: Начать запись?
es: ¿Empezar a grabar?
tr: Programlamaya başlasın mı?

source: Время выполнения:
es: Tiempo de ejecución:
tr: Uygulama zamanı:

source: USB_control_msg отвалился по таймауту!
es: ¡USB_control_msg tiempo de espera agotado!
tr: USB_kontrol_msg zaman aşımı!

source: Прервано пользователем
es: Interrumpido por el usuario
tr: Kullanıcı tarafından vazgeçildi

source: Проверяю флэшку...
es: Comprobando flash...
tr: Hafıza doğrulanıyor...

source: Ошибка сравнения по адресу:
es: Error de comparación en:
tr: Doğrulama hatası olan adres:

source: Записываю флэшку...
es: Escribiendo unidad flash...
tr: Hafıza programlanıyor...

source: Записываю флэшку с проверкой...
es: Escribiendo unidad flash con verificación...
tr: Hafıza programlanıyor(Doğrulamalı)...

source: Количество прочитанных байт не равно размеру флэшки
es: El número de bytes leídos no es igual al tamaño de la unidad flash
tr: Okunan bayt boyutu IC boyutuna eşit değil

source: Количество записанных байт не равно размеру флэшки
es: El número de bytes escritos no es igual al tamaño de la unidad flash
tr: Yazılan bayt sayısı,IC boyutuna eşit değil

source: Размер файла больше размера чипа
es: El tamaño del archivo es mayor que el tamaño del chip
tr: Dosya boyutu IC boyutundan büyük

source: Процесс может длиться больше минуты на больших флешках!
es: ¡El proceso puede tomar más de un minuto en unidades flash grandes!
tr: Büyük flaşta işlem bir dakikadan fazla sürebilir!

source: Разрешить режим вставки
es: Permitir modo de inserción
tr: Ekleme modu

source: Программатор
es: Programador
tr: Donanım

source: Снять защиту
es: Quitar protección
tr: Korumayı kaldır

source: Прервать текущею операцию
es: Cancelar la operación actual
tr: Vazgeç

source: Стереть
es: Borrar
tr: IC sil

source: Загрузить прошивку в редактор
es: Cargar firmware al editor
tr: Dosya aç

source: Прочитать
es: Leer
tr: IC Oku

source: Прочитать индификатор
es: Leer identificación
tr: Otomatik bul

source: Сохранить прошивку из редактора
es: Guardar firmware desde el editor
tr: Dosyayı kaydet

source: Сравнить содержимое
es: Comparar contenido
tr: IC Doğrula

source: Записать
es: Escribir
tr: IC Programla

source: Очистить
es: Limpiar
tr: Temizle

source: Тип адресации к памяти
es: Tipo de dirección de memoria
tr: Adresleme türü

source: Размер чипа в байтах
es: Tamaño de chip en bytes
tr: Bayt cinsinden IC boyutu

source: Снять защиту -> стереть -> записать -> проверить
es: Desproteger -> Borrar -> Escribir -> Verificar
tr: Korumayı kaldır -> sil -> programla -> doğrula

source: Длинна адреса в битах
es: Largo de la dirección en bits
tr: Bit cinsinden adres uzunluğu

source: Размер страницы
es: Tamaño de página
tr: Sayfa boyutu

# TMAINFORM.COPYLOGMENUITEM.CAPTION
source: Копировать
es: Copiar
tr: Kopyala

source: Страница
es: Página
tr: Sayfa

source: Размер
es: Tamaño
tr: Boyut

source: Тип адреса
es: Tipo de dirección
tr: Adres tipi

source: Длина адреса
es: Largo de la dirección
tr: Adres uzunluğu

# tmainform.label3.caption
source: Микросхема:
es: Chip:
tr: IC:

source: Команды SPI
es: Comandos SPI
tr: SPI Komutları

source: Проверка записи
es: Registro de verificación
tr: Doğrula

# TMAINFORM.MENUCHIP.CAPTION
source: Микросхема
es: Chip
tr: IC

# tmainform.menucopytoclip.caption
source: Копировать
es: Copiar
tr: Kopyala

source: Поиск
es: Buscar
tr: #-#-#-#-# catalog.po #-#-#-#-# Ara #-#-#-#-# catalog.po #-#-#-#-# Bul

# tmainform.menufindchip.caption
source: Поиск
es: Buscar
tr: Bul

source: Не писать FF
es: No escribir FF
tr: FF olarak yazma

source: Выводить чип из сна
es: Despertar al chip del sueño

source: Не проверять Busy бит
es: No verificar bit ocupado
tr: Meşgul bitleri kontrol etme

source: Поставить защиту
es: Poner protección
tr: Koruma bitlerini ayarla

source: Прочитать SREG
es: Leer SREG
tr: SREG Oku

source: Изменить SREG
es: Cambiar SREG
tr: SREG Düzenle

# TMAINFORM.MENUMWCLOCK.CAPTION
source: Частота
es: Frecuencia
tr: Frekans

source: Настройки
es: Ajustes
tr: Seçenekler

# tmainform.menuspiclock.caption
source: Частота
es: Frecuencia
tr: Frekans

source: Учитывать регистр
es: Distinguir mayúsculas y minúsculas
tr: Büyük küçük harf duyarlı

source: Найти
es: Encontrar
tr: Bul

source: Искать сначала
es: Buscar primero
tr: Başlangıçtan itibaren ara

source: Искать HEX значение
es: Buscar valor hexadecimal
tr: HEX değeri ara

source: Заменить все
es: Remplazar todo
tr: Tümünü değiştir

source: Заменить
es: Remplazar
tr: Değiştir

source: заменить на:
es: remplazar por:
tr: değiştir:

source: Искать
es: Buscar
tr: Bul

# TSREGEDITFORM.BUTTONREADSREG.CAPTION
source: Прочитать
es: Leer
tr: Oku

# TSREGEDITFORM.BUTTONWRITESREG.CAPTION
source: Записать
es: Escribir
tr: Yaz

source: Поиск микросхемы
es: Buscar microchip
tr: IC Bul

source: Маркировка содержит:
es: El marcado contiene:
tr: Aranacak rakam ve harfleri girin:

source: Выбрать микросхему
es: Seleccionar chip
tr: IC seç

source: Проверка на чистоту
es: Prueba de limpieza
tr: Blank kontrolü

# tmainform.Label_I2C_DevAddr.caption
source: Адрес устройства
es: Dirección del dispositivo
tr: Device adres

# tmainform.CheckBox_I2C_ByteRead.caption
source: Побайтовое чтение
es: Lectura de bytes
tr: Byte oku

source: Скрипты
es: Scripts
tr: Betikler

source: Нет секции:
es: Sin sección:
tr: Bölüm yok:

source: Выполняется секция:
es: Sección realizada:
tr: Çalışan bölümler:

source: Выберите секцию
es: Selecciona una sección
tr: Bölüm seç

source: файл изменён
es: archivo cambiado
tr: file modified

source: Сохранить изменения?
es: ¿Guardar cambios?
tr: Değişiklikler kaydedilsin mi?

source: Используется скрипт:
es: Script utilizado:
tr: Kullanılan komut dosyası:

source: Файл
es: Archivo
tr: Dosya

source: Открыть
es: Abrir
tr: Aç

source: Выполнить
es: Ejecutar
tr: Uygula

source: Сохранить
es: Guardar
tr: Kaydet

source: Сохранить как...
es: Guardar como...
tr: Farklı kaydet...

source: Секция =
es: Sección =
tr: Bölüm =

source: Выполнить скрипт
es: Ejecutar script
tr: Komut çalıştır

source: Начальный адрес
es: Dirección de inicio
tr: Başlangıç adresi
